[PAD]
[UNK]
[CLS]
[SEP]
[MASK]
20390
17556
9305
10457
15460
5553
4460
17085
5056
17465
13667
5176
16562
1556
6340
8924
14253
22617
17523
7377
21747
15945
17912
3754
17048
2408
12303
3009
115
8606
5888
11441
1670
1989
8784
14144
615
13626
10201
23624
2365
15832
20445
18703
13842
11578
5831
1479
15500
21529
399
15253
11268
5027
12288
20625
19521
1978
10501
18031
313
19249
15246
18248
21988
22097
19628
23525
14227
11503
10155
17429
827
3287
10959
13440
19554
13885
130
15374
15106
13681
11487
1938
9457
10141
5758
11717
21033
14237
7783
8559
20601
22396
23415
4627
16696
11099
12836
15228
9424
15451
21016
17929
14308
14188
12955
5699
4287
2608
7910
2708
16863
11791
1790
15525
125
21237
22698
8302
20451
23124
9302
9660
16363
22522
13102
3572
6751
21964
4543
7259
23013
471
9165
17619
19177
17833
9418
9569
23949
14841
19120
20082
15727
6504
2912
6900
23436
11534
3015
20849
3326
2302
13302
3827
12382
18566
9370
18038
11876
15737
19297
1813
881
9762
2533
23742
11012
17150
4494
12267
18427
994
5936
2656
18152
8476
19848
320
16853
7497
11996
19320
6278
398
11470
9999
16064
10269
13430
4135
7850
23489
19372
13669
6192
14262
15614
5949
3607
19038
13741
7475
19098
7633
7124
13847
22901
13879
16867
21676
20173
15905
23923
19180
7280
12106
20060
17818
17304
6533
17906
8457
14485
14583
9822
14794
18088
8111
14609
8216
23567
4800
12291
3204
220
9853
2899
3337
22037
21539
14807
21082
6292
5980
14658
6396
10032
18115
15104
6913
15904
21750
12645
17392
15198
15681
17144
6269
11009
4138
9459
2543
22300
3289
18589
20735
3208
9183
7458
7737
4004
10872
11007
14544
11376
20367
14517
19289
5199
11345
5382
1450
4517
16446
12232
14039
22173
20160
9698
5088
6058
3924
6537
6794
18403
10682
21840
5149
17386
11939
17276
22638
16749
14200
1779
4001
23378
16289
13572
16594
10140
8742
3362
117
3222
317
790
14494
23178
8044
18312
2644
6505
3617
23708
16774
1345
342
9556
23506
9551
9452
8366
20899
16380
19760
2809
11923
520
12685
22665
23387
1618
23348
7589
21511
15858
16168
21762
7890
13835
18968
16498
13411
4215
9633
20375
4881
4624
15448
11982
23162
17492
6928
5527
4647
13285
16855
4790
2786
18191
17692
21616
8145
9182
20856
19340
2662
2362
11471
14054
3631
19057
21041
5146
2672
14572
10205
22159
21879
3120
4335
14610
23250
6703
5489
14027
13618
9640
15504
21863
4081
15440
8954
18884
9694
5806
23017
19380
20903
17614
15631
18334
18288
16308
5629
1918
12337
19404
1761
11660
13167
590
7502
6885
10749
18289
1802
19008
22265
9067
17235
9016
3183
10258
15240
23036
4764
3832
2262
17960
14182
12883
19965
2741
14436
12482
8379
21759
4690
19379
22621
5155
20883
7615
6205
6265
6249
15633
3363
93
22183
6168
269
10280
4105
10382
2166
1086
4542
21895
1130
13145
19137
11428
7096
2183
461
7878
12990
20968
9318
842
7762
20020
11011
12689
10839
15540
4342
16595
23731
9615
225
17568
11051
360
19674
18969
5875
9110
15806
4229
15269
18280
8711
8015
9674
11278
11277
5369
1623
21746
8497
19381
11477
6028
7520
15034
8187
16280
2354
18076
1486
5318
20382
1134
9078
23135
4203
2984
3940
9644
20941
21523
8279
7083
15208
13856
13520
10957
1083
19221
13316
16697
17258
5722
18852
12595
5947
22085
6350
23775
20198
12582
21849
12255
12750
7109
19548
21579
9126
1449
4303
15517
8787
6592
11072
11084
9124
21292
19798
6043
7402
17415
10898
2105
17290
8252
10191
16585
11922
22761
13926
7093
1935
10343
8
17585
18425
14944
9027
23018
12338
801
21625
19203
23784
9297
15505
4839
2559
3531
21508
3667
21309
19479
1459
22537
23886
9769
7484
3583
23099
16541
12319
8319
2749
17419
3073
8798
11648
3259
7257
9515
19585
23218
15823
18175
14602
16877
1796
3071
4378
5473
16234
4894
9426
23329
6642
19690
18410
11848
12182
8872
2513
17717
22018
8935
13601
16588
21631
21052
12357
19287
19701
3768
11034
5930
22644
22800
6003
9369
17254
23801
10921
17544
9632
2349
6674
12795
6275
22145
11217
899
9665
1948
22188
20590
10092
17674
19613
46
8464
20344
4747
11404
21191
4427
5675
7768
21592
7006
8067
296
17081
1985
4589
21899
17184
9567
2784
22290
15846
7844
21476
7413
5543
9100
4904
20609
5338
4614
12558
20501
9813
6086
21078
5418
17624
20253
10766
13902
9518
23356
9835
2718
20910
3964
9329
17161
14662
3684
2521
13256
12594
6925
10817
6993
20169
3464
5882
22981
15758
1079
8413
8400
2064
23505
4399
22204
13172
7731
16665
2442
17127
20844
3936
4665
12743
7580
19491
684
5375
10666
23548
13286
3135
16979
5332
20457
9890
6034
8403
5953
22354
22276
18071
22462
6277
20678
5141
22719
1022
21134
11701
17050
11112
7345
3297
13690
20298
2174
8657
8475
2261
4306
23345
932
19438
4024
22059
22974
11402
8361
2406
14990
10759
17217
9268
20628
11274
6256
6633
2703
3060
1018
11689
17566
19750
15542
2882
10989
9671
1817
23391
17550
564
2046
20403
5087
2939
18657
6556
12415
4380
16229
5960
3664
7517
7891
5326
1767
6861
6678
18712
1428
8652
4505
18729
11164
3616
12387
13559
14375
12084
3590
21683
23037
613
7140
5493
8993
8124
23557
18040
9272
13406
13963
405
18319
16618
21288
22384
13517
13851
2193
23630
6753
19091
18350
3685
9055
11496
322
3875
16747
2083
6827
16637
15222
16745
23622
1423
10150
14282
4550
14988
3305
4005
7428
21854
2878
7195
18674
15177
18732
8099
239
18483
7312
19462
6379
9099
23395
2894
5355
7057
23226
8428
13185
15428
18497
11109
7028
8489
10130
23844
21367
12635
20327
4920
10277
1009
3141
4022
7003
15889
13050
7340
9564
2374
8348
3162
16046
11821
18010
11946
11507
5190
8560
4102
15824
1302
22756
17893
3733
18564
18958
10563
10484
16748
10831
18931
1339
15328
1000
20177
14254
10577
22391
14115
21805
21589
3349
6279
11564
16754
12105
89
12658
20463
16625
2856
22316
21462
23953
19165
2098
14189
10673
6237
19912
18087
10452
2854
18698
3870
1188
6584
21433
21501
7544
978
20170
868
14964
18942
2252
3395
14873
13491
12394
11022
22634
19284
23427
4296
6365
15196
23326
6455
16388
12817
10626
7828
18594
16381
21015
6600
187
3999
12335
7098
18632
4334
19534
20803
13746
14092
3886
16600
7466
7948
4297
8095
6646
20543
5245
12813
17673
3564
2468
22896
9495
21788
20243
18865
1338
10282
18387
12047
2582
14781
23205
6923
15178
17094
23913
8755
6206
22045
2565
6693
12506
4692
6106
15808
17239
8092
9638
854
11851
6518
13883
18615
1277
7777
11425
16908
13904
18890
23102
1257
4332
12787
4395
9101
15893
10574
6290
10504
16451
20448
6514
13077
17803
1799
11488
20449
5230
11220
21346
3476
16657
23847
13970
21336
23231
21967
3508
14055
20839
16238
5852
19127
22570
8310
19502
21901
17101
22197
15991
16266
356
6662
18998
17829
2298
13466
19724
9821
9082
6253
23803
10823
22566
21130
7169
5124
4320
21362
18141
17716
18446
9920
20768
16892
20005
5346
8957
3654
3540
18480
10389
799
14991
18023
16864
7000
1723
7845
4984
4044
21086
10882
18578
231
14194
8609
2536
4509
5292
5503
3826
19261
8108
8985
18612
14107
5854
21634
9501
10050
9981
17581
17952
43
7978
4748
9241
6259
19917
14727
1443
7298
8365
15295
5210
6312
18937
1008
7503
6938
23236
17508
16173
7039
21926
9857
23586
16894
16395
15085
826
3769
11361
14130
19973
13224
9862
9035
7820
17729
12671
3109
15800
10127
23021
19027
22182
15096
11593
15571
8779
19633
14630
7797
22673
466
2523
8745
7700
5816
7824
1620
7963
406
20320
17030
17907
11046
21996
11773
15701
23325
8621
22550
4464
10384
6491
20161
5090
12663
2123
1522
1343
967
8990
20314
11117
17919
13922
1435
3143
10463
9502
17916
4834
7516
11820
22985
8739
7019
4040
13345
5725
1005
5402
21196
4034
8050
15042
13068
14885
18192
20386
14904
4789
11977
3747
7943
15855
5780
19879
11146
15412
16267
6734
8756
6271
8313
4018
1181
22966
1997
4058
5411
1749
18349
5148
1924
11337
14591
379
7702
4536
14789
19662
8110
11757
6510
19915
742
14866
9362
6858
2539
7759
11173
17231
21569
16854
1433
21548
8980
18250
21132
8182
17341
22140
5128
9171
13892
21834
12028
8435
2963
8129
12224
10108
11059
6873
12726
7614
10244
112
15565
7394
21141
10900
20613
7227
16302
3908
8430
16126
15437
19199
3469
12304
3448
15129
5663
12625
19770
20453
10335
23080
14139
7695
11451
9627
3344
21558
10819
3210
100
6837
16065
9777
2863
14965
20906
10947
2954
20479
10714
1030
13129
13617
16555
14410
2321
19905
22513
12826
18905
1166
20180
6812
1122
7909
15402
2411
14597
14573
10014
3388
20295
5497
7968
9826
8440
53
4196
8851
23195
18333
19549
12867
2929
21055
1487
13363
21468
15329
12724
16135
19660
934
7483
16197
22677
8224
8845
6069
11565
23601
13576
3515
16739
9408
22810
16163
7465
18039
9675
13903
7774
15999
17343
15211
133
13388
11281
13761
10077
8963
10502
18982
12150
11495
20529
7108
7161
2917
6976
6553
14471
19222
15775
6295
2157
7459
1115
15967
2122
7639
6039
13157
14394
6772
1276
13998
13444
11542
16491
639
624
8950
12055
10929
14036
9260
1170
15019
4696
15330
22915
12141
18309
1931
20693
21339
15815
23859
18185
4491
4410
5642
11734
2641
7812
8997
9001
21920
6135
22801
17237
16814
6327
11393
3066
17840
21943
5240
6702
8898
5136
19493
21968
14627
13017
21817
20878
21374
21933
18792
2
13654
20596
7613
5043
12552
11827
1442
22892
21268
21261
17838
20135
16377
1643
17473
2006
2545
9417
24
3086
6878
14804
23597
16975
16085
1388
5354
15216
10630
11591
16636
6644
12475
16080
5651
20114
14228
14531
17406
17121
15288
2093
15804
10052
20452
3082
16254
18241
23761
23643
1665
11992
14304
1588
2992
2756
9395
2022
22355
20531
6027
22706
20306
20024
13112
14464
12221
21251
10821
13804
19546
17578
23430
4200
17356
22192
21430
15794
15346
7625
12835
2242
4273
9767
12980
15873
10347
321
23419
3092
10649
22709
22277
1729
11747
2607
19774
6684
11261
11556
12186
19526
3575
6419
23007
5038
3932
15143
15868
13676
6025
11397
17378
14434
3609
17719
19463
23735
13841
16236
15082
23433
10869
20409
10633
9793
12309
23575
18481
8502
10417
4925
6233
14910
4239
538
14284
12044
23090
14805
9040
15289
4688
3898
15286
1709
18700
15795
21614
8245
4165
19460
6676
20210
11189
9368
9117
2191
11892
16360
11193
17083
19844
22977
15444
1175
8992
16251
10082
8504
17078
3233
19793
17316
13691
2619
14753
7635
17608
18605
12310
23101
12046
23760
11078
11926
12521
19632
8589
12969
900
17856
5456
14778
9208
21495
4817
19123
22013
5719
812
11697
531
928
8075
18496
19146
19994
12317
14330
15441
13683
6544
21216
22754
8934
391
3136
16901
540
6357
2866
21456
9414
8738
7877
19388
3835
9908
15971
23875
1616
20557
1560
10784
1427
10651
18394
3551
7008
20265
273
13811
16532
14784
10173
19071
6784
9217
3402
2659
10610
5264
7285
5661
3241
10443
1545
17522
5502
4140
17099
23094
1912
9323
23501
7355
4596
8618
14493
11799
22871
3637
348
17274
13697
21608
397
5648
8705
440
1594
4668
14850
20092
14103
14707
14324
22938
7268
8494
8956
3273
13733
14913
18213
10804
10198
20960
20283
2688
8864
3431
17575
22695
12828
13511
18308
7065
17611
12220
15388
19161
15326
16247
11130
4837
7460
21611
15649
14713
693
21585
15890
4415
20262
12885
19364
5443
6673
16824
22963
5754
22815
5081
18855
2847
5551
23814
4892
5842
15922
6391
7665
14895
9191
6318
14759
11068
21115
837
7989
12769
13019
16062
8276
9086
17183
17195
5036
18089
2326
10371
13334
18207
8758
3911
10769
18275
14292
7102
15494
4104
3822
19232
13912
17519
7685
7788
5597
4929
12218
14121
21183
388
21961
2133
2750
2341
23118
18745
22177
17940
5163
23371
16071
22520
15011
671
15520
15135
18273
771
11196
9312
9074
19268
20540
18569
23081
1613
4049
2853
20924
17173
19235
22667
19186
9328
13238
5470
21272
13533
2288
19718
5761
2263
23569
20129
13187
16593
924
9771
12581
1369
11085
6240
4713
18631
13853
11229
19761
241
23839
22326
1073
23475
8100
6188
3780
921
23793
18572
15296
14619
17481
6696
17240
8687
123
1350
18652
10338
13079
7790
13147
2885
14621
12529
16627
8180
6119
6191
18619
526
637
21315
16379
14811
8399
12927
4551
12592
13786
11976
15180
6956
13451
468
23274
5286
1051
5336
20477
7212
1126
3467
3128
14044
16962
18124
3154
20150
2368
13367
15801
13499
12398
13016
17348
10736
1448
3788
4128
13186
18501
19508
8580
2781
18360
1947
13812
10466
5351
14783
5547
17983
20894
8147
16110
22927
614
15154
13772
3941
8853
2048
4133
2037
10038
15040
1417
23072
8091
13260
8996
5164
1349
8753
20450
3762
17117
21270
15392
22020
11622
11613
7904
2949
5258
11004
13594
5485
10257
2284
23956
11355
17262
3044
23753
2396
5420
3952
17443
17748
17138
17827
4050
22388
7372
9226
14871
8641
21587
21885
4264
15010
10772
13988
31
23802
2617
11894
15064
21661
4045
17638
111
16607
22759
15278
13524
22242
15493
17917
20721
12456
14251
8764
17797
358
17927
1896
690
14150
3820
8441
14089
21157
14428
5063
6808
4379
8683
10200
11125
21748
9599
22214
10230
8548
9105
8969
21950
5943
17721
23968
23185
12857
23322
5605
21415
5626
2808
6844
20136
22555
9353
355
12792
15259
8533
23065
14245
2689
15232
23478
16277
1828
15312
13337
18814
6358
23502
17047
10709
21405
1248
15147
19839
6443
20671
605
15699
23399
4290
20124
17999
3449
19077
8229
10040
5561
16991
12782
14334
20202
5314
5197
508
5653
13628
6465
3928
21900
20358
13725
3735
3249
10323
9299
23678
3632
19141
511
1098
18125
13990
17461
3553
13700
16528
2091
21743
22077
10207
6227
901
1081
6945
9512
9390
8351
9565
499
22224
20720
17095
11307
18159
10066
14551
12323
7932
17303
11731
19806
2588
17932
9794
2522
19465
16876
20097
22293
19010
13708
19541
1207
9589
16598
14077
16669
11448
3801
1664
6541
8832
2377
1574
15751
9229
20816
22180
627
9874
9625
18493
13317
18474
5275
14052
4750
17557
15763
19997
14362
20086
7062
17414
389
17448
17496
13235
21003
6589
19746
17332
20630
20907
19741
16492
20307
4535
3334
15400
1863
17606
4704
17642
6831
22528
1476
10636
21575
19882
16078
10350
15523
2669
15258
14924
8930
19158
6445
3511
2383
707
892
23157
20292
22557
16361
10715
17542
5468
17333
17921
17119
9411
11098
19562
15202
2062
390
7196
3626
4532
16270
19167
15356
12483
19656
21498
3380
12557
13472
11560
743
20278
2631
7166
23582
2813
19183
19709
5786
8835
15095
19537
19085
8926
7477
10279
7351
7333
23014
2005
2810
9292
12198
23637
6654
22554
4310
11624
14019
17005
9872
18757
5482
13490
75
253
7284
7799
17592
14815
13081
5571
16793
7773
3195
17170
10355
6830
8415
19049
5421
15149
19050
15005
17577
11925
18149
19657
19139
9614
22324
11394
23442
1654
17169
10489
22069
1791
1724
16373
6853
12236
2887
15084
15851
8002
16304
6829
1136
19796
4645
11063
8040
2914
12093
625
14745
23253
16956
11854
23755
17394
20101
2055
16806
16489
22100
7275
17286
10505
21784
9193
6380
1110
21571
19272
13938
22007
5895
19931
19574
19207
8280
5776
14683
4091
12467
23296
18523
5344
6697
17035
15173
3646
16586
20461
17640
6093
3438
2909
20595
12713
19999
347
10868
22887
23466
11729
14920
19765
3771
2039
14344
2492
7170
19606
17771
7867
10496
13608
6353
20949
14443
6310
5120
8777
2831
13968
13987
4013
14693
2604
1262
560
8150
22429
8087
16106
21338
11653
582
2361
798
6816
3187
15422
3693
15185
11638
21444
11083
18648
7595
13265
23403
7676
7165
8007
3521
6868
7050
2429
1672
19294
20600
16835
17670
546
19192
18132
15488
3310
1332
15996
3051
20309
14585
6777
8408
3406
19683
16816
12086
2325
9372
9163
19851
22456
11685
18302
11805
4224
15254
13094
11915
17962
17334
2843
2888
7088
21851
5759
9978
3500
577
17582
17602
23958
17038
19565
11810
4632
18686
4404
23614
791
11371
23127
5106
10486
10773
9248
19608
1531
14391
15749
3253
2558
8257
17696
5743
792
12858
19775
7410
22973
895
22791
23600
23722
2941
22640
23769
21794
10026
17379
18965
19129
21919
8626
16450
15243
14173
12343
22361
18498
805
5079
11313
2282
21633
23774
23028
4705
20970
6308
4766
18439
5440
6887
9808
21308
229
17498
1247
4851
18976
21936
8139
10149
4028
11466
22403
6123
8084
2437
3303
12153
12293
1690
2836
19648
1241
14316
14793
7660
14374
7599
18096
15506
21993
21687
8068
765
3309
22809
11056
13390
18639
21019
21276
20857
14432
5066
15519
16884
20458
3567
13497
5074
15613
236
20566
12777
23245
2880
5644
17464
12785
19943
18707
699
5728
9482
11435
18432
5655
9846
23298
23951
12696
21364
6386
21305
23726
23719
8726
15275
3816
19975
3656
13824
6729
23841
3343
10385
5971
3340
14994
15993
16296
11742
2976
22834
14260
1986
17377
1752
20713
4357
23818
10506
19555
8815
8516
10478
20550
19693
17908
22510
11670
7534
15998
686
15062
18320
7571
23446
23001
14774
18921
19520
22779
18979
4769
23978
15508
12806
10073
4373
13615
17709
15648
23800
9029
17032
8326
7770
17317
19349
11372
14550
5112
13788
14102
17425
15573
12784
23823
14138
21607
1533
2497
9149
4957
7155
17046
20861
20824
12389
8868
15618
3148
15398
22632
11909
22817
23450
9144
4066
10537
13007
13091
7099
14003
4798
8321
19341
7961
2264
2837
1596
17672
13391
11691
2921
14967
16391
20619
9858
21803
16404
23377
4660
1037
19673
13516
1221
18760
860
15325
23770
4771
20279
17834
14903
15819
7970
7539
3400
22633
23805
20624
12931
23431
5770
3003
21526
8477
15101
5956
20517
9102
3417
18156
4244
1805
16187
7908
13434
22161
18609
419
18541
2710
7548
4033
23490
8437
17398
6217
8333
5798
14289
9643
20744
13977
12546
3437
22103
12064
21222
10826
21329
21641
17878
10884
6524
19913
10599
4055
13409
9181
11611
18215
21158
19016
20681
15038
19843
10576
708
19752
11202
17820
3482
5433
3698
1827
1167
8803
16658
15685
5855
10621
9758
16719
8844
17949
4824
15965
16402
6247
15397
7344
18066
316
13197
1936
2676
5030
2841
19067
6562
4112
4959
11553
14886
6444
3545
6709
9352
12248
687
18971
5483
14969
1518
10858
19818
9107
23412
1974
13584
9507
11384
9800
22630
13976
20929
13423
2738
13023
17131
20052
4178
8138
8215
3156
5715
8596
1611
11053
10071
3347
1438
7366
12385
3234
18460
4206
15007
12562
76
23242
16066
22220
22914
8455
12092
197
4855
21265
10386
2975
1970
18950
20793
7022
14460
1797
7800
908
10958
33
18911
6376
6223
11318
10188
5729
5803
5404
19547
15646
21156
15682
3146
19670
3955
8204
715
23019
18408
15093
14165
1728
15255
10401
13799
4738
3368
13949
23552
5257
1200
6550
15061
21812
19040
4666
10199
11850
4533
16800
19271
12614
13356
16830
5205
20192
21699
17142
15021
50
18447
18761
8058
2082
21908
17714
6757
10908
11886
19392
20164
5014
23523
3361
13848
17208
5319
3934
20182
18789
19395
17115
23213
1093
11250
4711
21601
8449
2309
6204
23260
8952
13125
14202
21075
12219
18649
17495
9036
1484
12088
20199
11571
18006
19894
8911
5781
10733
10121
6850
19201
23695
1139
8439
15213
20230
23015
13149
16545
1633
15074
16709
19185
20130
16218
23186
3653
20497
19867
9196
2276
19861
13860
7479
13000
13199
17388
13702
18679
5707
14160
10093
12163
13688
10190
9751
16589
18826
18957
15394
16112
11362
12889
5805
12707
19691
4003
3977
736
19566
1480
10654
4445
8802
13852
1267
16475
6179
18284
1127
16178
22666
15933
12095
145
6534
22590
23216
14421
21799
8591
15591
18416
8961
6346
3325
13284
15653
20492
18068
11609
22143
5868
15425
22158
9946
8003
1962
17880
5621
23192
21421
9748
16052
22302
17933
9533
17306
18157
17559
263
8708
12437
16707
8079
22054
8685
16056
11047
20454
432
11057
17470
104
13485
9922
464
12169
21267
5919
13639
18726
7063
15414
18694
20260
2130
18519
3117
8938
20521
15497
13099
4195
437
22563
5846
2294
2815
13629
19611
6262
11194
15041
4315
3813
6488
2476
14336
23879
965
4873
18342
1776
10045
4546
21195
21219
23243
3672
13318
6260
10005
14770
19588
18952
12774
1907
20054
12968
12548
22243
5479
14998
21376
5901
8453
6548
9676
2179
13941
14169
3005
7091
22599
10933
8484
23033
5085
13026
10997
23372
12764
11227
16129
1299
13104
7735
1453
22379
14676
4682
20952
14211
19437
15647
14946
1285
1311
14574
15961
936
22611
16426
4299
18396
5540
12517
1198
13173
702
16638
8501
10363
7016
5631
8944
415
22179
13088
18924
4037
22350
952
16521
1521
18929
17876
10395
6296
4260
21218
17114
5637
36
10986
587
1880
13695
7822
20908
12195
14732
15837
10447
17206
4453
16349
2584
21310
22358
1860
17436
5983
13750
5684
9211
18699
16039
19430
23517
1234
8037
22443
10801
22447
127
13065
16330
1959
12751
448
13827
11705
6973
15986
21252
942
21490
11101
20316
21564
10132
19945
6165
11581
18518
22894
11436
5465
22341
17124
3007
11852
5126
8674
7136
17022
7983
19995
22086
10863
11737
16990
15803
16918
15223
6454
2585
3891
10153
7873
6801
8005
21540
22165
14226
3496
1458
22353
15900
13101
9914
4253
10518
10613
5238
14108
7937
611
15220
19258
20287
5235
2192
11957
9192
20655
15445
467
7833
3507
5019
17743
12891
7893
19801
4763
3182
9219
23407
18714
18926
20748
1376
5082
20323
6104
418
266
9778
19406
7135
976
10456
9803
8490
8503
7628
12863
14319
9203
15373
8247
20158
3856
19640
19804
7761
30
13743
1656
21070
6045
97
9025
5585
13272
492
21719
16086
14614
13921
6508
7486
12897
15053
3412
19133
8747
7125
13956
10185
15193
2061
2094
16740
4559
17295
12669
1141
11723
18725
16758
7600
8102
15784
2432
21882
9076
23402
4813
2347
506
16043
3922
4115
21006
17753
8168
2723
21975
16605
19830
17788
16872
5844
13782
11800
12531
16299
15923
12515
16711
7872
12469
9289
22330
809
5183
3220
3335
14063
23498
9026
21815
9962
19131
16283
1111
20716
6917
12037
10074
20328
22521
15634
12690
1745
8119
10515
11071
4672
11421
23696
20435
5748
23006
13481
4831
12932
20731
21103
18206
10663
22148
13787
10251
5011
22855
21159
22394
22246
14905
14883
10739
15146
18706
16690
8665
7874
9669
16067
17597
4059
13953
8863
2640
20584
5934
5291
23924
20493
14021
9996
2994
13837
8265
11562
15910
22588
2099
21001
22515
16132
3470
15291
16911
16273
22577
22027
9277
10017
8082
1301
19076
4936
23470
18353
872
10538
7167
20719
19106
14742
8882
7045
1490
12617
1821
12886
11563
9160
16355
18137
18258
12945
22524
22128
15951
5175
11904
23177
14980
9911
13107
7356
11968
6575
1905
16723
9713
18510
13558
7174
21833
6761
1104
10641
23200
9113
7990
14856
6215
1446
12362
18765
23904
3201
2705
12396
5720
3517
16976
8268
21406
13055
14170
5552
15304
646
11677
21545
20482
21865
5757
6234
16073
6557
16120
20427
23711
12547
20761
9351
1923
10393
6266
2217
19953
13029
22233
4864
3707
22548
2774
11224
18788
4086
4695
9918
394
1309
4637
14068
23889
10103
10145
4649
19668
3677
12680
9974
12779
18899
17785
20346
5070
10428
19531
14457
1771
14828
13225
21768
15847
10436
9484
11498
18246
11963
11469
8731
17474
9212
2687
214
16284
15471
2135
16672
4954
539
7956
11804
18538
18656
20769
9552
16494
13838
15137
11621
7239
1961
17534
13087
2274
18311
23821
6293
10394
5495
3799
18093
9935
6463
11603
1689
11163
5528
23750
324
8959
22708
3605
4499
2404
21220
9056
8026
951
20416
19876
6347
5600
12243
10549
1509
2795
12447
11919
12438
10809
18406
14363
12026
8875
174
14439
21645
11010
10600
20994
15770
18878
17727
12668
11427
13480
20473
880
15327
15814
585
10642
18655
10953
598
1991
7826
4154
5305
3638
18512
19334
18863
2800
4052
10004
12900
5283
5843
14133
4233
1429
5858
6739
21580
1857
7175
565
800
23237
8238
9125
10813
22171
13366
1686
3971
5731
16235
6063
8819
17897
17599
14012
18675
17884
8027
9797
19825
477
426
23892
9739
126
240
14751
9929
14537
23578
8585
14579
1988
5599
2818
12977
19776
20048
14931
3101
9317
7696
16886
18082
1177
1071
16359
19423
10628
13452
1520
9684
21797
5352
17096
9573
15227
23681
18687
3278
10260
14263
13722
6361
7807
2355
9968
17271
11594
13314
8989
7969
6748
14611
17088
7244
22762
17691
17432
14441
20888
18557
16456
19570
21990
7129
16838
8197
17533
9876
18254
15992
13515
9994
10400
17589
16188
15783
1212
14912
10157
18972
7441
19223
18398
20015
2134
16036
5697
5021
20692
14709
7382
8689
3929
16095
5524
11222
17934
20890
16550
4420
15081
4846
14029
23702
12081
7535
20474
21982
14907
6798
21008
6120
1239
12376
14961
727
16081
11597
722
16015
9445
16686
23460
18571
21236
19400
3556
14801
12829
21493
17863
19937
4513
21659
13070
2757
9645
23819
19532
5890
3765
14291
6411
8008
4527
18876
17357
1995
1576
4235
16295
1101
2852
14114
1500
11554
11267
21375
16829
402
5814
13134
17822
3917
385
1045
18548
14893
8332
13047
18463
23546
10937
20137
4597
20685
7903
11081
12715
12786
16701
3140
4950
4566
7562
21595
9446
21286
7336
23487
23799
18420
16679
5716
11866
9137
6706
7675
807
6434
16497
11311
11453
7490
9738
11654
14933
10410
17527
7617
23302
17098
9371
22068
21668
13133
21820
3036
318
12363
11314
9327
2835
7955
20676
15760
4074
14730
19625
22989
11172
140
20220
862
22936
12351
22332
5794
9852
6446
7411
5666
17025
14919
8824
21775
8615
17321
11893
22923
19522
7780
20710
7442
23079
7653
4730
5924
14685
4448
13028
23776
5116
22082
10053
13397
4578
19333
3790
11094
10421
14426
13736
8586
201
4309
23106
21934
17535
21263
22106
22400
12402
10196
3284
22512
8038
10464
21136
15977
7232
20352
12434
458
23066
11790
16501
7499
20642
9234
6564
7406
22194
5026
21229
11739
12204
18379
18183
23782
16261
8902
922
1260
1624
12485
21877
10497
16228
17375
7742
11390
17067
2291
16040
23207
8104
7608
2563
17509
1517
22208
12987
22459
6513
4965
929
13425
1713
8431
5154
23366
9933
3878
69
23950
19345
13765
5678
9209
11516
10308
4948
6578
16507
8903
16276
15672
14223
21371
6599
9538
19630
23573
13211
14960
14265
23686
6685
189
11349
2460
1711
16014
18267
8060
12223
16514
5848
12761
20542
21399
17870
8074
2696
2316
3879
34
10559
15092
14669
15078
2747
10529
3651
21137
4749
22481
11650
17981
21848
23320
22729
7758
4908
13718
8506
9695
14827
20825
23971
5921
1830
700
23553
16421
20168
8422
7297
23866
14286
12174
17828
17732
6481
19217
20822
17690
10605
71
22285
7415
19484
18495
2490
22433
4988
1751
22854
3717
13965
4856
22514
6614
8545
5711
10669
795
1477
8527
19415
10317
12492
13573
10348
21781
7561
11338
6785
17441
15914
2335
11998
11357
5606
4671
4284
22699
5690
20019
23874
6915
10508
18245
9242
14792
19903
9844
6773
4998
490
17265
22994
21170
7054
1612
3151
22866
3873
16796
4381
19951
1401
14215
1769
22891
2803
23882
23259
749
14096
1225
1755
10306
16777
1945
13463
15151
3029
13239
14069
10544
1785
2763
22340
23894
12930
20639
3294
13338
18755
23396
7056
11438
1379
2791
22308
4931
5174
18980
12554
19244
12269
12276
601
21439
16443
18773
6080
19631
4000
19135
6001
2007
2910
9437
16190
8353
10215
15194
8948
20227
6501
11073
6507
8552
14360
10043
23893
11536
11843
19227
14518
15790
11835
13310
16029
21077
15658
5790
17872
19488
23862
13959
17738
5595
4830
23707
15521
10917
7082
4149
12005
3353
23824
2930
12537
14554
1847
9291
10007
19004
2690
7730
13217
22662
17227
12275
6819
4707
7912
6092
6769
9759
20072
15598
19550
13878
16093
4363
12199
2424
8442
12497
1273
21850
23202
21811
19410
11320
21122
13253
10511
15124
19394
15619
16702
16706
9861
7035
23444
16684
21723
5127
3752
4990
5534
1451
10994
2940
3045
12254
12030
19454
8498
17580
13126
19569
23796
23566
19311
9284
1850
12989
2140
1032
9576
15127
2804
12407
11663
10374
6914
15162
12906
21663
20326
9178
7559
1288
21124
1845
22693
9034
16516
1738
10134
19647
23699
20302
15978
17734
11937
7431
10532
8277
911
9838
19211
5512
23754
11796
18049
15604
18499
15351
15997
6202
7416
991
20094
10680
23191
17017
15047
9509
4364
16582
4717
8557
10453
9051
14799
20184
2529
5646
23658
22409
6899
23045
6774
16856
4525
4015
12904
18637
5730
7112
22345
13958
17484
13429
22547
12185
251
3114
23563
3292
2889
14915
8598
7398
15305
19799
4740
17612
20860
15966
15499
12022
10770
12509
19854
12947
12545
19200
12021
3231
7450
23140
14097
21871
9320
16024
21383
10870
22058
1760
2050
21682
22651
10487
1838
7295
4285
8561
21653
18754
14196
10932
11122
18111
1866
23184
17272
1290
4522
18265
8142
17650
1583
14776
12476
22561
16750
14846
11419
2931
7168
11316
8184
14855
15501
19079
8870
18794
5557
4592
18422
12042
13732
6549
21859
469
23222
8905
11024
8376
10227
14622
19504
11157
5693
4915
1855
6268
15391
9998
6056
16384
9663
21861
15020
17031
6810
18378
4865
5789
4073
8194
22604
12937
9755
9970
641
21065
6529
2423
11285
8895
15301
4870
8675
20617
18454
3398
8734
16728
1748
17338
21657
72
2146
14347
7950
9071
8583
22480
635
17646
4756
19336
5643
23927
15833
19584
22131
10334
5680
20016
16662
4961
5252
10873
10592
5574
5054
16156
23053
12052
11005
9608
6516
3509
129
4255
1067
3601
5929
15779
2540
10862
4274
2959
3217
18449
4755
13297
19476
10322
3679
8225
16406
14309
8412
6298
14006
14078
8470
21745
8525
12928
16888
3127
9347
629
17118
20795
13605
13304
3269
13462
12359
10710
8723
10615
15632
16530
3831
18491
17487
16306
18806
12600
21356
4065
19731
20569
6051
8917
6448
7029
16399
5870
10640
17518
13468
18547
8327
21911
19350
4498
3103
11766
22217
6397
6559
6125
1550
11259
161
4338
18370
3244
15829
11410
15098
19206
17389
5177
23341
2657
21902
8530
9548
3972
18844
7078
20093
13233
10470
3591
11975
16466
7084
1006
12666
21321
20594
14877
4802
4635
21304
18253
22746
11721
21217
15103
15651
1085
15013
10950
17965
9108
216
9809
600
10811
20966
688
12302
6591
22162
8266
16570
15403
9673
21711
19601
19837
9635
7886
8346
22421
7144
10952
23152
21989
12008
3124
5555
3013
16127
13534
7163
15578
3565
7958
315
4054
2681
22118
5328
18196
9344
16813
10261
14482
22530
17446
17355
5883
8544
21598
19170
7122
20734
455
22906
14026
1310
5744
1651
6008
9451
22551
8811
14234
21700
712
3954
2301
12423
17538
23688
20270
1812
4375
2479
23384
22203
750
974
13004
20226
22408
23251
12709
10472
17249
15558
14208
23297
23690
6423
16265
11557
23671
2143
18211
3111
14146
21143
19642
13054
11329
17651
16931
15242
15510
19717
21402
23092
16469
17335
3802
1189
23915
11987
18666
10236
15659
5474
19300
2328
732
13624
21949
2902
2080
16365
10500
17160
11096
22227
9987
19358
5031
14466
11422
11017
17459
15748
14477
12470
15848
23263
10954
22531
23280
7922
16544
22329
16939
20510
19238
21971
12854
10247
12277
18838
2469
5349
11239
13774
15017
19827
4031
12440
20351
7875
14506
14821
1825
15899
6322
11722
438
14892
11710
3720
830
11400
13612
16275
10060
18163
20726
8754
23902
7626
16848
16583
23860
20586
10861
9273
23284
9687
1695
2190
2893
1960
12048
367
12746
7444
22414
4347
8165
15968
1696
6911
18722
5064
4862
21332
2357
5972
2969
13339
14287
20191
7313
110
13984
18165
7610
18437
21076
11605
6082
21269
15090
3341
6195
19500
15443
11869
12339
19156
11236
11950
18050
1508
1105
2936
19062
15880
19947
21437
13384
13717
7570
23970
10699
6468
4143
16776
20806
3397
1027
21131
17479
16725
18380
481
3974
18819
10524
10907
1519
3880
1908
23173
7631
13595
8198
2155
16713
21609
22851
5114
9783
2663
3396
5044
14653
19153
11506
4452
19533
8673
19036
3153
7205
10776
17826
1312
8190
3313
23618
3657
18310
16535
22504
5048
1754
15331
14463
18902
19144
16778
2260
2758
15384
5703
16858
7173
11216
16230
12017
6624
13803
12994
4194
12341
19100
20120
23105
17902
22820
23647
21
16396
23333
14038
14452
14317
14629
1206
1395
8487
5198
6409
18522
12490
3355
10291
12110
16878
863
19954
21171
11416
8890
8378
5861
2544
3570
23125
22041
20564
18007
261
2457
2017
15079
6603
20291
20742
23264
18436
20712
18941
16068
4025
2032
5668
12203
9699
3624
5635
13685
16518
4231
3246
17507
17188
11045
20487
6943
8676
16383
17874
20955
10113
4938
12237
11871
4584
6381
3409
8385
22606
6982
21855
3408
13797
17014
11003
1303
11414
6875
10611
2562
5891
1034
19125
16763
18417
2919
19763
7217
7622
9805
14088
14571
17991
14310
15772
17346
6413
7871
840
1671
80
6161
21660
15155
3068
22925
13544
15602
23029
22256
17774
23373
2343
20796
2716
20523
16981
1012
14562
13422
16870
21428
19417
21032
14244
6733
62
15595
5851
22898
6068
20926
12949
6389
4723
14763
12181
11344
850
6992
3901
4208
8518
18455
21597
4108
8975
8838
13939
7911
12523
21116
23477
912
662
14603
17427
5689
11230
20998
19560
20204
14549
12433
730
20213
13929
5885
17871
23316
8344
7153
7193
15333
7931
6300
5377
3304
4781
1294
23933
9787
17452
9827
6172
2638
23314
15730
3785
16817
8248
3576
22160
20318
10830
20398
20989
14633
16534
583
10392
20195
9331
6967
15266
9313
2358
18627
5625
5459
1437
5406
17140
8801
16375
5662
1627
530
4680
6462
21225
4788
9661
8163
23196
1928
18629
3465
19094
5598
18606
2839
22487
9403
6554
1526
17251
7346
8402
17948
14535
12039
21352
19871
7320
8809
4702
12327
5454
8056
9993
4889
5766
1135
17540
19314
9954
21516
11449
10528
6055
17862
11455
11304
22991
11795
14738
7596
6985
3800
2667
1078
17882
3761
6800
5281
12633
12845
3907
557
15782
5740
17684
4158
12825
18542
4810
22270
20948
7592
2735
14407
4228
18859
1595
23752
6686
15854
21985
18299
20163
15842
20863
23368
12895
21584
2002
8226
15318
12805
15205
22904
18285
9931
11190
23662
13344
6098
2161
17680
3133
2868
22042
17367
13748
19055
10674
19886
1810
18203
7224
18244
1342
11970
1684
15378
23497
15323
18476
23022
13213
10178
16961
11770
21791
4978
8818
8551
7532
10116
18134
20486
10822
14216
19327
22926
2904
18643
19498
10763
13246
15913
21718
2453
16840
19834
13038
23268
11366
495
20156
18640
1632
777
23599
3614
10847
6766
9205
17944
16553
6835
5340
8908
10792
16199
10960
5364
6478
6054
4416
18471
5223
8594
11903
7713
10326
16104
8300
19478
365
23471
11138
23288
11954
6640
22741
5853
17181
1219
19020
13059
16074
14876
17920
13469
22944
21449
4339
5994
2987
20950
15716
2137
5001
21042
18293
11635
19792
21916
9938
6154
1516
21058
21739
3742
21290
9282
17450
4029
6779
9612
5180
14094
9717
8922
10313
21801
12519
19026
11673
8028
12123
6095
15245
4667
9461
13829
12311
22613
10956
2512
10242
20154
9904
1635
21144
673
22323
8650
22484
13613
11712
22078
13925
7809
9243
18208
8860
21153
13933
11762
5811
221
5665
19397
3738
10671
14332
20429
9129
23209
15669
4902
22805
1501
6906
5432
11589
17383
4814
12999
5068
10838
462
19564
22608
400
13313
8240
16394
23504
1629
8781
17062
22492
22060
14558
9603
5976
15902
21736
9462
16685
15750
17600
2448
16431
7339
7862
13288
12962
18155
10943
4541
14704
20377
19864
19226
19134
4630
2313
5907
5969
18913
22095
9683
20368
15105
5321
2767
21120
1582
8582
19000
10183
16920
3481
13188
5098
1998
22897
5974
18252
21426
3787
2027
3518
4010
22574
23465
21921
20589
12228
8255
12789
3301
7020
15627
13460
18778
1507
2796
11286
19065
9357
21947
12421
17264
17116
9990
7923
21386
11118
11532
6477
17250
2389
6629
13696
23741
18281
1585
21409
1953
6087
13552
3595
18608
4071
13957
6984
12739
11632
18837
11417
12612
10293
20001
18167
12572
4267
9275
29
17787
23380
5134
8397
17749
18555
11032
19215
23666
5339
4434
5521
16587
17579
23462
9730
12676
11955
23542
15767
3132
16121
23144
21331
207
5840
13025
2314
3389
19318
20782
7940
3121
17072
18306
21201
23549
16606
12844
2482
19777
574
16003
7245
22312
12872
1406
20238
21819
7984
18219
446
5620
909
5345
8789
10876
7489
9598
18870
15726
16441
13243
19784
1606
13507
457
21145
15773
349
18160
6356
22336
20108
2950
3413
21118
8769
16033
18839
2254
13951
12622
16926
1784
3558
7270
21473
6612
14030
2766
14921
4011
12101
4323
12877
5769
12149
20984
21051
16353
22868
7579
2092
14578
20215
19469
5299
8555
10241
6062
14239
22150
3357
10865
1777
18815
12377
5777
13277
362
11888
23002
1721
11485
13948
1580
7905
20701
734
675
5408
3563
9900
10
9941
7771
21478
10886
11317
12961
7067
16019
23798
23820
21987
19328
5587
9003
3319
13555
18069
4869
134
1511
3523
6015
22370
21311
9321
6171
12445
1542
10768
9094
6212
18736
6320
16554
14575
4141
6809
6274
14973
19756
22009
15012
2980
10520
4914
5282
17702
3063
12413
6618
7061
2203
4209
15201
9588
11815
23532
6272
13790
13146
6150
18367
18298
2413
9135
9265
4564
7966
1049
16704
12035
22823
11846
3501
8452
21098
11917
5535
12590
4146
1441
14110
14520
20313
11333
38
22000
21341
6568
3692
16966
15599
10690
20142
19938
14402
15607
2867
7576
12115
6263
209
751
19489
10195
13952
21186
23336
11272
23685
2456
8699
23005
704
1893
23975
23910
8491
10842
1229
10828
7917
23128
547
21560
7525
3581
19814
21392
13006
20575
19346
12449
18338
2139
6131
7854
18441
10604
12162
2535
3027
21776
21092
12373
17591
16954
10047
10164
5322
21888
3411
2350
5821
4411
13044
16767
16577
6364
7243
21751
20561
3489
22952
1291
8931
10485
1266
18683
1707
13396
20231
1300
451
18240
4053
18261
10583
17397
10430
15485
5837
16775
21302
1223
15338
21954
18414
1020
5002
22849
10344
16385
11548
552
4644
3374
6048
5892
19081
19426
4658
6935
8970
20236
21422
5593
20845
8017
84
22163
14901
18451
6658
10796
20408
19727
9018
13566
20491
3850
16174
10760
2444
22132
15533
20539
10408
7146
9115
17603
14066
99
7375
9236
19308
10911
1638
23788
11619
7769
22105
17079
10977
82
6282
16336
13630
1044
16424
23469
17922
13321
21760
12404
15620
2942
23286
5315
1977
4676
19054
12851
7326
17203
21112
22038
2085
16820
17924
10094
10266
22321
7556
22377
16370
10354
12516
13031
11749
23441
14729
7172
57
1646
10021
22343
19891
159
11087
1470
18343
7529
713
7470
15927
7311
13424
23447
23869
8791
15169
10748
19949
3532
1362
12619
14819
14218
12939
2671
22033
21705
3369
5733
14679
17019
20951
14697
1819
215
18633
20042
13962
19921
13036
15507
19103
14586
11607
13192
81
153
7798
22141
14519
14201
3652
12559
3620
13519
8293
17362
5756
13699
20269
4861
12286
7514
20034
5944
22446
3342
11656
23778
18478
13565
5267
8669
6521
11960
23592
11822
3131
10938
13642
19247
3193
6328
7619
5718
15622
13486
18178
6338
5750
19627
7704
6002
1354
7369
10889
20239
13662
22144
7705
5139
6113
1717
16057
16155
17799
9077
20308
2906
13093
11626
22670
13648
12603
23009
20961
7512
4623
7898
19658
15307
3108
18056
17796
5771
4376
2626
7049
16917
5392
6175
16913
5041
20667
6281
5505
22726
17505
659
16372
4345
5004
15629
7711
19058
9536
1025
19330
23429
10609
8359
6650
17956
5812
13703
22022
23068
15586
14051
15380
12859
11458
7689
7443
17008
20425
5838
4131
15797
11082
4710
5542
22463
12555
350
23235
13714
7149
9779
12215
3716
3630
21413
11158
8460
21696
2253
16009
4537
23034
20462
8999
21059
11392
2466
18695
10854
8987
23900
1485
719
3680
18824
10915
6061
14093
15548
22585
11811
6149
9522
8919
21946
3171
12879
8407
22829
17567
11807
16192
13602
19838
14838
7763
19751
2247
21827
23043
10832
17558
18739
1372
17517
8113
10106
13210
8773
12176
9571
20943
23762
17588
23148
3681
11048
5903
13913
18822
21199
19823
171
17562
10171
12925
11651
17201
3877
21852
17677
20852
20389
16744
12973
4826
23736
7425
13638
12738
19355
5511
18906
5428
2807
9456
9143
640
7397
15454
6528
9737
5958
15786
8638
18467
10123
17831
14240
11131
22498
18428
12392
22195
2897
20384
18786
2568
15708
10939
15043
13508
9497
10356
4217
4125
8810
18927
12820
7609
10707
19942
16329
18840
13571
21938
16038
12374
13755
3529
18059
14480
14190
12570
21021
9388
9279
11895
3902
132
5172
12695
1491
17197
14952
15385
23607
17547
23107
4701
8201
9997
2030
18344
22206
8267
11403
17990
2731
21105
22483
15755
4583
6683
13066
7506
19275
3199
3584
11060
11242
1161
4162
15821
22229
18730
11814
14056
7314
20061
8387
9310
6200
22374
13148
18079
9955
23156
7179
13657
12579
17661
15252
10981
11398
21664
10475
14178
6572
6112
2884
11760
22278
1712
5721
619
21770
20836
7808
8360
16815
2206
1475
14327
22997
16727
11576
19492
1253
22080
5448
555
1601
8203
15557
680
16134
334
10473
6745
18628
14315
18883
16409
6882
6449
12540
23160
3471
3237
20006
19117
8284
20489
7323
10340
825
2928
18780
19685
3889
4488
22236
12116
11868
18782
7282
485
3022
6433
23692
11149
17320
22954
21197
21866
10332
1408
21427
16130
18871
5793
15464
23278
6236
4728
9715
20357
4877
12205
15925
706
18891
15421
7825
17626
16016
12553
11889
19363
6050
23539
21945
21474
18442
21510
6892
17020
22127
12623
5073
2927
3041
4348
21184
19992
21924
21998
21869
6201
18002
15762
3983
21198
8485
13740
10353
2195
23448
12280
6737
7452
4857
13295
20272
15928
4317
8509
12755
789
14141
19955
3587
20567
22036
22450
25
4847
22115
12871
2028
17311
6890
16845
20321
16297
23046
2966
3173
433
1720
16420
10694
11644
7498
3953
12874
8228
13604
23055
21822
16264
782
9706
22503
20571
5677
1663
17857
2271
12499
18747
15150
16819
19669
19494
13981
23098
13567
17795
12257
9532
11754
21149
13477
3841
1770
20545
18274
11031
19164
915
58
7972
19126
3736
12278
20392
17885
8063
8512
23850
3699
16768
3824
4611
14829
4652
3851
23794
14045
488
17868
16250
8162
5450
13274
9060
4909
1183
20247
22777
23635
12366
12981
4727
21542
20013
13203
5254
9184
17100
5110
16294
18098
4964
16551
18795
13219
13447
16269
12700
5277
20
11829
8717
905
12702
3330
13887
15581
5337
22739
1634
23309
20399
17402
19257
6617
3544
14022
2842
20975
858
3728
5147
252
5006
2546
22432
11162
18121
5823
14516
3025
10046
9788
1457
11588
3378
13955
2322
15347
23146
12313
17997
21680
9346
256
3694
22406
20059
20333
7513
9734
1980
2269
695
19958
2266
4051
8973
9069
966
19916
20963
13808
21831
14760
8646
7474
1092
6787
23375
387
8073
12032
13625
2407
8447
8286
19409
5979
14525
22846
12951
2212
346
13075
23744
20875
13454
2141
14803
20469
11938
4765
21677
11405
8595
18036
23888
15024
3660
22262
4512
8837
21546
8554
15569
116
7289
9636
470
17108
1502
17776
20282
13108
2465
8812
8722
14981
6264
10790
18996
19467
135
13678
16449
21842
1898
10955
9478
15566
8066
14459
17458
3830
12159
14604
20439
8034
20383
4734
14710
4928
16461
4008
6667
18685
12832
17288
9134
11693
10041
10758
10011
9167
4478
6351
5228
9828
13150
8839
169
14161
8051
19637
18925
6074
17621
7736
3445
4440
474
7427
21808
13735
14897
18688
11533
14808
18967
9925
7327
1377
5880
14858
23748
21922
18711
8697
21282
18535
10556
21787
7376
11
10523
969
23400
6424
1322
5104
11817
16382
2211
21635
11550
6267
23929
1080
4225
19470
4576
3585
1967
6013
5775
3100
20773
15434
22714
21485
2149
12551
22318
12561
5773
16044
9230
4506
3823
13042
1859
2015
22622
13153
22881
2219
2403
7317
14001
15309
20187
7741
3904
2616
1195
10891
20040
5178
15642
21613
3663
20987
3539
16319
23660
2794
14635
11223
8202
21999
18916
2601
3944
14013
10627
972
19880
13072
0
16832
12501
15008
6636
13159
21013
7638
13118
17987
6484
44
16809
17180
22607
11116
3062
22717
20537
21414
20702
18556
4489
8242
16557
2351
18073
12360
13357
4722
102
22152
7882
12213
11681
3566
9222
22879
21499
18102
20393
9170
7511
7566
1674
5586
17273
12520
7712
17177
5970
8848
7451
21997
10312
13616
10349
12985
19499
5222
23088
19790
2760
12995
9910
6643
21868
19641
12723
16483
5531
18184
847
16343
5698
11614
14582
3606
12161
536
5447
22099
17168
6203
6153
12823
1023
13085
22624
16423
3779
6085
9746
17681
12880
9083
10020
21538
2251
13994
9276
2488
11489
23822
23931
20330
7884
22705
4428
18237
2915
10983
1383
20732
15650
21675
1155
9539
8234
7032
15834
20050
16729
21806
17976
23636
4397
3429
13871
12618
18395
11983
22491
23151
12097
9387
12261
7965
22281
4383
23727
19009
1211
11104
151
9256
7322
14000
1934
3805
5363
9013
19809
17159
20515
4109
16663
6907
450
15531
13086
19860
8727
21214
19940
14702
7650
15292
16202
17926
22703
512
16755
14495
5010
10378
16128
3992
13506
1858
354
15891
3345
17802
19587
23390
567
10174
897
9540
2877
12075
14552
9724
17658
19173
11818
2793
12045
20212
21918
4278
2003
1108
10970
15068
10692
5272
5856
4718
6828
13670
10644
1793
18846
1439
17545
19002
19
8368
17091
22734
13653
5706
19452
8222
13382
13832
7840
3365
3872
12154
4709
12701
1872
21535
13916
19274
5410
19283
19281
11630
17830
17814
4409
484
14176
13140
18684
6975
4977
14942
10635
6368
19567
12565
13778
2151
21174
11615
12697
16795
2342
14294
11037
5801
6186
7194
18316
17036
21260
6067
15805
19292
12058
14277
10586
21381
2977
17354
4579
22807
4996
15073
10272
17669
17296
19302
13303
14845
17754
7651
12704
11207
16087
20133
2777
21450
21958
254
1157
23175
21766
9843
3105
14032
1129
17457
2283
23732
16922
6407
1703
23050
23674
19527
12569
18563
13713
22073
6369
8463
1064
8390
22908
10540
2991
13593
13414
1224
21466
14722
940
11858
13869
19132
16413
9535
9984
2871
4783
21591
13230
22886
10765
20007
15199
7206
15630
670
2759
18282
11328
16103
16058
19865
14131
6213
2881
11491
11300
17746
9745
9952
15046
18774
18224
1124
2435
311
2702
16077
3323
19035
2045
16849
3530
13255
18818
16465
10740
8185
4980
19675
11555
10705
7636
871
8307
5144
5247
8081
255
22532
8411
3804
12535
23938
8611
6072
12296
12783
17246
11750
3642
3528
14644
16444
10318
16335
8846
22460
13554
21249
2943
15987
2579
23404
820
9883
16515
7386
13500
14440
16259
16560
4390
16338
11628
19066
20484
4280
3636
6155
14791
16738
6570
5638
4142
10369
17537
19220
6711
16219
18949
4937
2118
1363
7496
12074
12217
18268
9863
7543
12652
5674
6651
16510
8227
2600
16208
422
21804
18579
20930
15593
16206
14475
15025
15167
13840
11258
6717
11299
1058
5799
14616
18062
11295
14874
13394
17630
16317
20065
14062
18383
5295
14221
17639
4945
959
54
10289
21557
7692
9172
2074
23265
16249
5817
2566
9021
8096
6283
14448
5053
6226
11897
9957
15492
2319
8759
6682
7784
8625
20802
6052
10800
3384
8653
20568
9964
17889
14229
3085
19888
11870
15048
17351
6724
5849
19104
10730
4
4806
12027
1337
16639
14174
2799
21046
1532
15903
14325
17693
9547
5166
4829
2517
4467
5464
14983
15714
20365
12530
1154
9420
19361
3683
21825
6024
20144
22193
23945
17471
94
9342
18507
1358
1929
16416
22187
17800
4259
7260
15606
20068
20031
10166
2286
21455
12841
21846
9075
22628
12568
15709
20248
4616
16322
22785
3950
14887
10080
596
1949
13540
20456
15911
20412
9977
11377
4693
10993
98
1554
10708
19580
2862
12538
11092
13043
11727
12673
8827
13727
6749
20919
11240
3230
23318
23704
2107
10431
19239
5003
570
10075
21547
7391
7859
18963
4429
21483
21099
9379
22825
9963
10208
14540
5902
3956
16959
5430
961
18150
5545
14695
8823
17850
8797
4082
14737
14156
14489
4819
8921
9365
15609
18291
13375
5913
16105
10895
1537
16772
927
4392
1226
14843
5028
11413
13989
2970
2549
4600
697
22702
15153
21667
15071
12735
3746
7754
17904
20869
19013
8776
13259
9355
15426
18080
3224
5991
17722
10112
9647
2268
13539
8658
9927
19966
12753
21009
7110
11930
15636
19732
8364
15310
10704
9123
4087
16060
857
15810
19335
7491
5452
7726
15785
18577
16789
12975
18009
11606
17055
21173
3144
15526
2256
15345
12070
995
15366
10961
16769
15482
13570
1815
17860
11541
6660
1572
14147
7997
6881
15026
5873
6736
17413
20771
15237
13946
23616
12025
15908
23836
17163
1879
19712
11423
22955
7986
2778
10980
19645
14507
6701
22969
4470
7080
9491
7034
4691
1070
22467
20322
16488
2883
1567
8311
9366
22811
15828
1983
1597
9118
17052
15939
22364
23656
8741
10990
12147
9477
9585
18372
11133
16951
13992
4063
9063
2503
14236
23061
22307
1416
8369
301
2194
8273
8303
19721
7189
4371
5123
4160
14418
21241
4582
23562
14474
21475
21603
22523
17742
4277
11696
18970
5963
274
6958
3
6440
14337
879
3004
6452
7952
1213
890
17353
12752
6066
3490
22723
8382
4518
14258
16462
11746
8459
10098
1941
7439
18647
6245
8600
489
17361
14387
4170
13021
10696
15735
13232
787
11036
9223
15645
3283
14157
11838
18697
5221
11759
14976
22239
4465
2962
22802
10539
17790
23059
2628
19743
16581
19898
23180
18103
168
14450
16203
2049
2496
20413
733
4706
8640
4151
21050
16902
2238
22136
12983
13954
5015
9377
17023
2216
8312
3314
15430
3351
14642
9356
22744
5072
7457
16139
14773
23225
22034
11103
8885
19269
19729
18077
16610
13195
10300
14757
19487
7296
885
10874
13461
6471
7939
10978
21639
15959
22138
7864
4282
6740
13
20547
472
18194
7813
2390
11323
14699
21204
6807
11629
5323
11849
14823
19230
3549
20885
14638
973
10743
7358
20369
22064
6343
7246
6345
3435
12706
14795
16378
9298
12838
16307
18892
12439
6041
9814
22586
19536
17463
4872
13380
4860
11248
10530
17294
19910
12107
9500
2171
14113
23132
13325
4295
13729
22386
22655
12710
9066
5341
15679
22166
16180
12873
6075
23831
22999
17172
16674
2823
16324
17462
16523
17911
1848
7070
11260
7851
17130
17891
7683
5017
14636
11468
18186
7335
13927
7524
21303
17093
6094
14047
19337
13545
22428
5676
22773
944
283
12637
21147
14073
6869
19295
17516
6317
18764
17648
2732
12909
20397
23041
14187
17004
5664
3860
6905
5236
720
7906
21316
23054
6978
9756
2811
2861
21530
10129
8271
2156
17563
16542
18117
16907
5937
12496
22030
8090
18133
7942
5320
20099
7634
7030
19375
17112
12425
22672
2551
23837
4655
19039
5872
21878
6707
22057
9091
314
6793
11568
20559
3627
11910
18376
13476
3033
5673
2686
12015
1356
19436
3750
22850
20043
12403
1756
13609
4283
6049
14313
7012
9131
20668
14842
11308
21172
19832
16001
21983
20651
12322
17426
23654
14346
11186
1512
18861
5471
21981
16944
5409
3949
14112
18897
15113
4430
4901
13178
19754
4570
2851
11256
12290
2712
8831
1368
21227
8244
6079
17968
23734
12952
10476
10114
19102
10678
4179
9433
11834
22909
5836
4145
2633
5601
17867
15427
15980
18517
3178
8343
3475
14640
22081
16258
3504
22643
15226
20251
20467
4361
13364
22808
8396
1109
5224
1096
968
6941
983
21845
9121
14484
4181
3209
17327
10785
5065
20303
2957
18287
20912
11698
15467
22359
363
10629
18003
5774
17914
18920
14465
7661
21837
8648
16718
4708
9245
18276
20181
2742
2097
13826
16623
20838
5476
15972
278
22573
22837
23648
8296
4355
7896
107
21795
16405
10434
19352
16198
17293
23199
17731
1676
20644
10561
1774
22061
17511
3076
7068
14743
7357
13223
13179
10546
21992
11695
5103
12630
15390
2332
22418
16474
2664
22953
18081
10897
16785
3279
3715
17816
20404
5975
572
20418
7582
943
12653
5500
22415
22280
14016
6551
3407
2168
9097
12049
5080
18611
23183
11321
6218
5353
16761
7424
13557
15050
23331
15768
8593
7288
15297
1282
10935
6196
5827
10096
19739
17068
23486
4193
23604
23709
3926
19312
8972
18413
21732
5833
1333
12350
6189
11916
1228
9584
19671
15901
2771
17689
19218
9773
18868
7719
23120
20329
13712
17193
14509
22792
12191
14224
9723
946
8736
1197
23194
10099
8126
14086
10223
14498
3049
19677
17937
13855
13350
22055
18247
2926
3608
12160
9525
11931
4080
8235
633
12972
19447
5093
21779
11247
22700
18035
15703
10727
16288
7688
17455
3817
12544
23946
4116
21345
14959
21325
2519
4425
16169
14790
19387
15812
19986
5253
16619
14393
22506
7142
6821
21167
14970
4400
18973
17442
6648
1566
664
16846
9492
19037
9465
8016
15765
12801
12974
21182
163
13814
15496
6492
3602
2642
23271
5316
6169
8445
276
8301
18242
7271
6503
19023
14042
10440
16882
9753
3753
20364
608
2905
8703
4184
5226
15058
23541
22423
13176
12815
5509
10658
10499
10425
13679
9807
563
5461
8988
14896
8125
11714
11339
11411
21729
12762
18570
18154
18262
23040
12436
19624
23315
13074
10167
1196
9031
7293
14985
21735
65
21994
11409
7307
1659
20762
11837
5650
13279
5935
931
4485
4882
2627
17851
3749
3168
17647
3077
20911
18418
13868
10517
21047
3937
13494
12405
14626
17521
15962
11771
19323
6073
12080
10973
4654
5209
18131
10143
20010
4534
18841
3346
157
12536
8117
21923
22735
15335
21744
494
22458
13686
17123
7926
15924
19753
10545
8495
20764
21369
22732
12003
18799
1075
11687
11908
4324
18187
8259
15160
2520
12183
2475
14297
12543
13588
920
16645
11382
12489
14545
15551
8175
8069
4746
10835
17255
18810
20524
2451
852
16092
14423
19331
1011
13509
3650
6560
1112
7528
12230
308
258
9657
19545
8660
13177
3844
21963
12918
16875
907
509
6886
4973
13730
11735
2925
6525
14429
10850
17033
15825
15624
11208
22273
16495
23507
20837
17336
23103
2418
11129
18663
2229
794
17587
15140
8358
9550
4501
20221
7343
6604
22098
19455
3149
18720
19396
19787
4544
4715
2147
16860
19582
1125
8841
1630
17277
4585
16154
12000
5860
9742
7519
2138
19849
4935
4673
22682
817
3020
21447
12065
13141
21140
7007
2186
8627
18011
17988
18934
7662
10009
7300
13280
2225
10065
829
5405
12011
22088
2052
9831
2698
9487
13240
20859
3306
7748
20203
23445
12942
15875
3671
20873
515
16403
23921
20162
16418
8923
13819
14848
5988
4926
15214
22748
6388
18301
13598
1571
6162
16671
15236
14618
2997
6607
9471
9967
16484
23500
23136
9441
10668
1994
10871
7533
9168
7538
332
16333
7117
21713
